[{"SUBMISSION_DATE":"2/7/15","FIRST_NAME":"Kenneth","LAST_NAME":"Gallagher","PROGRAM":"BS","CLASS_YEAR":1948,"CLASS_NOTE":"Kenneth Gallagher (BS) checks in from Carlsbad, CA: \"I am now 90, retired, and frequently traveling around the world.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/20/15","FIRST_NAME":"Robert","LAST_NAME":"Woolheater","PROGRAM":"BS","CLASS_YEAR":1952,"CLASS_NOTE":"Robert Woolheater (BS) relays, \"Walking off the golf course, I noticed a man carrying a UCLA golf bag (not a common occurrence in Las Vegas). Good visit─I was class of '52. . . . he was class of '53.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Edward","LAST_NAME":"Poll","PROGRAM":"BS","CLASS_YEAR":1962,"CLASS_NOTE":"Edward Poll (BS; 1965 JD) opened a second law practice and management consulting office in Ventura, CA.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Harold","LAST_NAME":"Blaisch","PROGRAM":"BS","CLASS_YEAR":1954,"CLASS_NOTE":"Harold Blaisch (BS) updates, \"I'm retiring from active law after 49 years. Law is getting to the point that civility is a unique thing. I am doing a legal network and will still take in cases but will refer them to new attorneys, Jane and I will be moving into a 55 and over community in Indio, CA, with plans to enjoy some relaxation. I will finish my book that I started 19 years ago about an exciting criminal lawyer with interesting and famous friends!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Bill","LAST_NAME":"Washburn","PROGRAM":"BS","CLASS_YEAR":1955,"CLASS_NOTE":"Bill Washburn (BS) shares, \"I recently called Dr. Sherman Mellinkoff to find out how he is doing as I do from time to time. Found him doing well, particularly considering the circumstances. While attending UCLA, I lived behind the Mellinkoff's house in Westwood in a nice apartment and became good friends with the good doctor and his family. I did a bit of gardening and occasionally babysat their two daughters in return for a place to live. Sherman and I didn't always agree politically but I greatly respected his point of view and it actually caused me to move toward the center politically. In any event, he will be celebrating his 94th birthday soon and it would hard to find anyone who has done more for UCLA than he did during his 24 years as Dean of the Medical School. I certainly wish him a very happy 94th and glad to report that, although I am a great UCLA athletic supporter, Dr. Sherman helped me to understand that other activities have contributed to the great UCLA reputation, activities such as those that take place in the medical school.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Richard","LAST_NAME":"Bourke","PROGRAM":"MBA","CLASS_YEAR":1957,"CLASS_NOTE":"Richard Bourke (MBA) is now a contributor to www.Engineering.com/designsoftware, a web-based publication for the engineering and scientific communities. Richard declares, \"Full retirement has no appeal!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Kenneth","LAST_NAME":"Jeldan","PROGRAM":"BS","CLASS_YEAR":1957,"CLASS_NOTE":"Kenneth Jeldan (BS) has been retired for 16 years. Kenneth writes, \"Worked for Sunkist Growers 16 years and Calavo Growers of California for 21 years. Now living in Cedar City Utah, I traded beach going for snow shoveling. We feel that the Lord brought us here to participate in child ministry through our church and also Child Evangelism Fellowship.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Richard","LAST_NAME":"Freeze","PROGRAM":"BS","CLASS_YEAR":1961,"CLASS_NOTE":"Richard Frazee (BS) updates, \"Following graduation, I was drafted into the Army; two years at Fort Sill, Oklahoma. Back to California and law school at Hastings College of Law, San Francisco. After 20 years practicing law, I was appointed to the Orange County Superior Court in 1987. I have since retired from the court (in 2005), and am enjoying retirement in Monarch Beach, Orange County.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Kenneth","LAST_NAME":"Wood","PROGRAM":"BS","CLASS_YEAR":1963,"CLASS_NOTE":"Kenneth Wood (BS; 1996 LLB) received his law degree in 1966 and has practiced law ever since. Kenneth shares, \"Over the years, we acquired Arabian horses and I served many horse businesses and horse owners on various legal matters. I have written 5 books on the legal, tax, and business aspects of the horse business. Now I am working on a website for the horse industry which will be launched soon covering legal aspects, taxes, and economics of owning horses and providing services to the horse community. It will provide updated services on each of those subjects on a regular basis to all subscribers. There will be contributing authors and interviews with industry leaders and professionals.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/19/15","FIRST_NAME":"Jonathan","LAST_NAME":"Beck","PROGRAM":"BS","CLASS_YEAR":1966,"CLASS_NOTE":"Jonathan Beck (BS) has started a new non-profit, The WEsolution. Check out the details at wesoution.org.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297505238831283479/Enjoy_HOME.jpg","PHOTO_1_CAPTION":"Jonathan reminds us, \"AllWEs WEmember, WEall o.u.r. WEONE!\"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Gene","LAST_NAME":"Borg","PROGRAM":"MBA","CLASS_YEAR":1966,"CLASS_NOTE":"Gene Borg (MBA) checks in from Florida: \"If my math is correct we will soon have a 50th reunion coming up! There was around 22 of us in a special program headed up by DR's Case and Schmidt. Anyone out there want to plan a reunion?\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Larry","LAST_NAME":"Alton","PROGRAM":"MBA","CLASS_YEAR":1967,"CLASS_NOTE":"Larry Alton (MBA) reaches out, \"We are setting up investments for Chinese citizens who would like to invest in a safe and regulated U.S. environment. We hope to help these individuals protect families, diversify asset location, and obtain greater control of future events. We would appreciate your experience and suggestions.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Mike","LAST_NAME":"Befeler","PROGRAM":"MBA","CLASS_YEAR":1968,"CLASS_NOTE":"Mike Befeler's (MBA) ninth mystery novel, Mystery of the Dinner Playhouse, was published by Five Star, an imprint of Gale/Cengage Learning, in January 2015. After a 39-year career in the computer industry, Mike retired to write novels. Please visit www.mikebefeler.com.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297339612972984875/MysteryOfDinnerPlayhouseFront.jpg","PHOTO_1_CAPTION":"Mike Befeler's ninth book, Mystery of the Dinner Playhouse","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Ahmet Ates","LAST_NAME":"Aykut","PROGRAM":"MBA","CLASS_YEAR":1970,"CLASS_NOTE":"Ahmet Ates Aykut's (MBA) business in Turkey offers company evaluation, investment feasibility analysis, and strategic planning based on fully integrated scenario simulations, risk management and predictive analytics.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/7/15","FIRST_NAME":"Donald","LAST_NAME":"Gonzales","PROGRAM":"MBA","CLASS_YEAR":1972,"CLASS_NOTE":"Donald Gonzales (MBA) managed a multi-billion dollar manufacturing P&L, successfully consolidated diverse international and domestic operations, and developed start-up businesses to profitability.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/7/15","FIRST_NAME":"Elizabeth","LAST_NAME":"Ghaffari","PROGRAM":"MS","CLASS_YEAR":1973,"CLASS_NOTE":"Elizabeth Ghaffari (MS) is pleased to announce publication of her third book titled Tapping the Wisdom that Surrounds You: Mentorship and Women (Praeger: September 2014). As a professional speaker about leadership and as a coach and judge at entrepreneurial business competitions, author Elizabeth Ghaffari found that young women seeking \"a mentor, coach, or sponsor\" often had no idea where to find such support-or what they needed to do to benefit from such a relationship. In Tapping the Wisdom that Surrounds You readers will learn how to recognize invaluable mentorship opportunities all around them-from family members, at school, at work, in recreational and social settings, in the media and politics, and even from those who have left us. The true-life stories and testimonials presented will inspire and motivate readers to endure, succeed, and prevail. For more information: http://www.championboards.com/tappingthewisdom .","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297853887944695941/TappingtheWisdom_sm.jpg","PHOTO_1_CAPTION":"Tapping the Wisdom that Surrounds You: Mentorship and Women by Elizabeth Ghaffari","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Robert","LAST_NAME":"Nauss","PROGRAM":"PHD","CLASS_YEAR":1974,"CLASS_NOTE":"Robert Nauss (PHD) retired on March 1, 2015 from the University of Missouri-St. Louis. He most recently served as Chair of Logistics and Operations Management and also as Chair of Information Systems. After retirement he will continue as a Founders Professor.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"12/30/14","FIRST_NAME":"Michael John","LAST_NAME":"Reiss","PROGRAM":"MBA","CLASS_YEAR":1976,"CLASS_NOTE":"Michael John Reiss (MBA), a management consultant, now writes about food, wine, and travel. Take a look: www.foodandwineaccess.com.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Alec","LAST_NAME":"Cheung","PROGRAM":"MBA","CLASS_YEAR":1977,"CLASS_NOTE":"Alec Cheung (MBA) updates, \"Just sold my company last October. My daughter is getting married in May and my son is expecting his second child in August.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/6/15","FIRST_NAME":"John","LAST_NAME":"Dupre","PROGRAM":"MBA","CLASS_YEAR":1977,"CLASS_NOTE":"John Dupre (MBA) has started his own consulting practice since leaving Mattel in 2011. John writes, \"You can learn about it on my website, www.johndupreconsulting.com. Love to hear from anyone.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Chip","LAST_NAME":"Gregory","PROGRAM":"MBA","CLASS_YEAR":1978,"CLASS_NOTE":"After working at HP for 23 years, Chip Gregory (MBA) became a 7th-grade English teacher in Andover, Massachusetts. Chip relates, \"It has been a wonderful 13 years of teaching but it is time to hang up the silly tie and become a farmer and home-repair expert in Maine. I still remember the two years at UCLA as being wonderful except for intermediate accounting which nearly did me in. Where is Kim Bodger?\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/19/15","FIRST_NAME":"Hajime","LAST_NAME":"Endo","PROGRAM":"MBA","CLASS_YEAR":1979,"CLASS_NOTE":"Hajime Endo (MBA) updates, \"Having retired from the national government in 2011, I am working for a private university by the name of Bunka Gakuen University as chief administrative officer. This university specializes in fashion and design and is located close to Shinjuku Station in Tokyo.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Jonathan","LAST_NAME":"Jan","PROGRAM":"MBA","CLASS_YEAR":1980,"CLASS_NOTE":"Jonathan Jan (MBA) details, \"I have founded Eco-Vision Foundation, a California 501(c3), last year. Our mission is to clean up the eco system with beyond-current-science knowledge. We have solutions for water, PM2.5, as well as soil ecology. We can also help spiritual awareness for the willing students. Before entering in the greedy financial arena, I was trained to be a theoretical physicist. The door is open if you'd like to participate.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Julie","LAST_NAME":"Simon","PROGRAM":"MBA","CLASS_YEAR":1980,"CLASS_NOTE":"Julie Simon (MBA) is the author of The Emotional Eater's Repair Manual: A Practical Mind-Body-Spirit Guide to Putting an End to Overeating and Dieting. She is also the founder and director of The 12-Week Emotional Eating Recovery Program, an alternative to dieting that addresses the underlying imbalances that lead to overeating. The 12-Week Program is now offered in a teleseminar format for those outside the Los Angeles Area.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297330409102664728/EmotionalEaters_cvr_fnl%20%281%29.pdf","PHOTO_1_CAPTION":"Julie Simon's book, The Emotional Eater's Repair Manual","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Scarlett","LAST_NAME":"Hu","PROGRAM":"MBA","CLASS_YEAR":1981,"CLASS_NOTE":"Though a Finance/MIS major, Scarlett Hu (MBA) left the banking industry long ago and will be celebrating her 17th anniversary at the J Paul Getty Trust. She is an assistant director in Getty's Information Technology Services department. A recent high point in her career was leading the Getty technical support team to win the Help Desk Institute 2014 Team Excellence award. She has organized a few alumni gatherings at the Getty for both networking and art appreciation purposes.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299318643452828092/Getty%20team%20and%20presentors%202.jpg","PHOTO_1_CAPTION":"Scarlett Hu and colleague receiving the Help Desk Institute award","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/26/15","FIRST_NAME":"Mitchell","LAST_NAME":"Langbert","PROGRAM":"MBA","CLASS_YEAR":1981,"CLASS_NOTE":"Recently Mitchell Langbert (MBA) and Jeff Brown (MBA) had lunch at Dock's Oyster Bar on 44th Street and Third Avenue in Manhattan. Mitchell writes, \"We were trying to list every student in Eric Flamholtz's nucleus class from fall 1979.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"James","LAST_NAME":"Maddox","PROGRAM":"MBA","CLASS_YEAR":1981,"CLASS_NOTE":"James Maddox (MBA) has recently joined Avison Young as a principal in the West LA office, focusing on capital markets and strategic advisory for major commercial real estate owners and investors. Avison Young is a Toronto-based full-service company with 60+ offices in the U.S., Canada, and the U.K.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299315833071177747/FINAL_001.jpg","PHOTO_1_CAPTION":"James Maddox","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/29/15","FIRST_NAME":"Karen","LAST_NAME":"Fischer","PROGRAM":"MBA","CLASS_YEAR":1982,"CLASS_NOTE":"Karen Fischer (MBA) updates, \"This year marks the fifth anniversary of my booking agency Pasifika Artists Network, which represents award-winning performers from Hawai'i and the Pacific Islands. I was also honored to be voted to the Board of the Association of Performing Arts Presenters, the national organization for the performing arts presenting industry and the convener of APAP|NYC, the world's leading gathering of performing arts professionals (including artists, agents, managers presenters, and venues from across the country and around the world) held every January in New York City. Note that my MBA was in Arts Management, which specifically addressed the issues of not-for-profit arts institutions.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Judy","LAST_NAME":"Francis","PROGRAM":"MBA","CLASS_YEAR":1982,"CLASS_NOTE":"Judy Francis (MBA) offers, \"After 15 years spent in Africa as a U.S. Diplomat, I have collected an incredible amount of African artwork, furniture, fabrics, and sculptures that I don't have room to continue storing. If anyone is interested in purchasing, please email me.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Martin","LAST_NAME":"Rosen","PROGRAM":"MBA","CLASS_YEAR":1982,"CLASS_NOTE":"Martin Rosen (MBA) shares, \"For the past 30 years, I have been a lawyer with L.A.-based law firm Barger & Wolen. Last October, Barger merged into Hinshaw & Culbertson, and I became a partner of that firm. I represent life, health and disability insurance companies in litigation.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Tony Van","LAST_NAME":"Collie","PROGRAM":"MBA","CLASS_YEAR":1982,"CLASS_NOTE":"Tony Van Collie (MBA) has launched the Pallet Shuttle Barge or PSB, an innovative inland barge system, on Benelux and French waterways for transport of goods on pallets or in big bags.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297292188332500720/IMG_0844.jpg","PHOTO_1_CAPTION":"Ton Van Coillie's Pallet Shuttle Barge in action","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Nicholas","LAST_NAME":"Benes","PROGRAM":"MBA","CLASS_YEAR":1983,"CLASS_NOTE":"Nicholas Benes (MBA) has had an impressive year: \"This year was one of many milestones: (1) My non-profit Board Director Training Institute of Japan, has now trained more than 440 directors or director candidates in Japan; (2) I became a grandfather: Tom Kelley was born in February; (3) I convinced Japan's leaders to adopt a corporate governance code, and advised the dietmen and the FSA from start to finish on how set it up, and the contents. I made more progress in the last year of policy advocacy, than in the preceding 15 years.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297298741534950410/looking%20up.jpg","PHOTO_1_CAPTION":"Nicholas Benes's grandson Tom","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Claudia Browne","LAST_NAME":"Curtis","PROGRAM":"MBA","CLASS_YEAR":1983,"CLASS_NOTE":"Claudia Browne Curtis (MBA) announces, \"I have gone to the dogs, retiring happily with a 135-pound four-legged pal.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299302647630604601/2013_11_15_9638-2.jpg","PHOTO_1_CAPTION":"Claudia Browne Curtis","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Russell","LAST_NAME":"Stockard Jr.","PROGRAM":"MBA","CLASS_YEAR":1983,"CLASS_NOTE":"Russell Stockard Jr. (MBA) shares, \"I'm a full professor at California Lutheran University teaching communication and marketing. I've done service work in Haiti and travelled to Cuba and Brazil in the last two years with travel study classes. I led students in my own class to Costa Rica in January 2012. About three years ago, my spouse, Dr. M. Belinda Tucker, became vice provost for the Institute of American Cultures at UCLA. Our older son is now working in IT at Stanford and our younger son is taking courses to apply for a master's programs in occupational therapy. I got together with classmates Kevin Martin, Al Perry, Steven Turner, and Al Maxwell last summer for a great lunch together. Life is good.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299316333252220004/Chili%2C%20Dar%20%26%20Dad%20Jul%2027%20%2713.jpeg","PHOTO_1_CAPTION":"Russell Stockard Jr.","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"John","LAST_NAME":"Troidl","PROGRAM":"MBA","CLASS_YEAR":1983,"CLASS_NOTE":"John Troidl (MBA) comments, \"Enjoying immensely a nice combination of teaching and consulting. Spent a month in Mexico during the past year. That's quality of life! I use my MBA skills all the time in various aspects of life. I'd be happy to connect with former GSM friends.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297268270081836951/Troidl%20photo.jpg","PHOTO_1_CAPTION":"John J. Troidl","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Don","LAST_NAME":"Brosseau","PROGRAM":"MBA","CLASS_YEAR":1984,"CLASS_NOTE":"Don Brosseau (MBA) is still teaching tennis at Griffith Park but needs more students. Don writes, \"Doing a second Chapter 7 this February. Check my website for some of my videos: www.tennischiro.com.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Rick","LAST_NAME":"Hunter","PROGRAM":"MBA","CLASS_YEAR":1984,"CLASS_NOTE":"Rick Hunter (MBA) relates, \"We've been rediscovering our love for UCLA this year. We currently have not one, but two, sons at UCLA. Tommy is a senior civil engineering major (looking for a job) and an RA in Dykstra Hall. Chris is a freshman. We've been able to visit the campus many times and are really enjoying the experience. With three Bruins in the family, my wife, Naomi, is Goldilocks. I'm semi-retired and very involved in our community in Redwood City, CA. I direct a half-marathon to raise money for our schools, and I serve on our parks commission. All very fulfilling.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Matthew","LAST_NAME":"Irmas","PROGRAM":"MBA","CLASS_YEAR":1984,"CLASS_NOTE":"Matthew Irmas (MBA) shares, \"After a 20+ year career in the film business as a producer and director, I have moved into residential real estate specializing in the west-side of Los Angeles at Partners Trust in Beverly Hills.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/21/15","FIRST_NAME":"Mark","LAST_NAME":"Triska","PROGRAM":"MBA","CLASS_YEAR":1984,"CLASS_NOTE":"Mark Triska (MBA) happily reports, \"Maria and I recently celebrated our 30-year anniversary with two trips to Burgundy and South Africa in 2014. I was promoted to executive vice president with Colliers Commercial Real Estate after 25 years in the industry serving the greater East Bay in the San Francisco Bay area. Still growing merlot grapes in Livermore Valley and living in the other wine country! Looking forward to the Anderson Alumni Weekend and catching up with classmates this spring!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/22/15","FIRST_NAME":"Bob","LAST_NAME":"Curd","PROGRAM":"EMBA","CLASS_YEAR":1984,"CLASS_NOTE":"Bob Curd (EMBA) shares, \"I have told many of our classmates of losing my best friend, Captain Van Lemmond, while serving in the Marine Corps in Viet Nam in 1969 and of eventually blaming myself for Van's death. What I did not know was that I have been suffering from PTSD because of my guilt. I have to thank my wife, Julie, for encouraging me to get help. Thank God for Julie! Julie took me to the Veterans Administration for treatment three years ago and I am getting well. In fact, everything is much better now. I have a wonderful family and my faith has grown and I am performing engineering design and analysis that has never been done before. My story has a good ending: I have become a lay servant in the Methodist Church and I plan to host a group of other people suffering from P.T.S.D. one night a month at our church.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/19/15","FIRST_NAME":"Marie","LAST_NAME":"Steckmest","PROGRAM":"MBA","CLASS_YEAR":1986,"CLASS_NOTE":"Marie Steckmest (MBA) updates, \"I'm currently the UCCE Master Gardener volunteer at Marquez Charter School. This volunteer job utilizes much from the MBA program as well as other skills. I also am the founder of Palisades Cares, a 501 c3 devoted to encouraging community service.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Mary","LAST_NAME":"Lor","PROGRAM":"MBA","CLASS_YEAR":1987,"CLASS_NOTE":"Mary Lor (MBA) discovered her inner artist a little later in life and is now a painter and fiber artist. Check out her website, www.marylorart.com and her Facebook page, Mary Lor Art.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299221927013311700/Painting%20by%20Mary%20Lor.jpg","PHOTO_1_CAPTION":"Painting of her children by Mary Lor","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/9/15","FIRST_NAME":"Andrew","LAST_NAME":"Shapiro","PROGRAM":"MBA","CLASS_YEAR":1987,"CLASS_NOTE":"Andrew Shapiro's (MBA) activist investment management firm, Lawndale Capital Management, recently celebrated its 22nd anniversary. BarclaysHedge ranked Lawndale's flagship activist fund performance in its top-5 equity long-biased funds at least three times in the 2nd half of 2014. Andrew continues to regularly speak at national conferences focused on corporate governance, hedge fund, and activist investing topics. His work as an activist investor was recently featured as part of a story, entitled \"Board Games,\" on NPR's \"This American Life\" and \"Planet Money\" broadcasts. The story highlighted Andrew's role in a campaign to reduce the excessive compensation of a public company CEO. A link to the story is here. www.npr.org/blogs/money/2014/12/30/374011462/episode-593-board-games.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"12/5/15","FIRST_NAME":"Alexander Barry","LAST_NAME":"Williams","PROGRAM":"EMBA","CLASS_YEAR":1987,"CLASS_NOTE":"Alexander Barry Williams (EMBA) retired in August 2014 after 38 years with TMS.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/22/15","FIRST_NAME":"Sandra","LAST_NAME":"Cress","PROGRAM":"MBA","CLASS_YEAR":1988,"CLASS_NOTE":"Sandra Cress (MBA) writes, \"We're into our fourth year in Nairobi. I'm still the director for Africa for One World Play Project (www.oneworldplayproject.com). This past November, thanks to our founding sponsor, Chevrolet, we celebrated our one millionth nearly-indestructible football donated to communities in need! Of those, over 600,000 have gone to partners we support in 33 countries in Africa.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297645367512723021/Sandra%20Cress%20with%20Rwandan%20Orphan%20Cooperative.jpg","PHOTO_1_CAPTION":"Kids chasing One World Futbol in Touloum Refugee camp, Chad. Sandra Cress MBA'88 with an orphans cooperative in Rwanda.","PHOTO_2":"http://www.jotform.com/uploads/alumoff/22746332668157/297645367512723021/boys%20chase%20ball_Iridimi%20Refugee%20Camp%2C%20Chad.JPG","PHOTO_2_CAPTION":"Kids chasing One World Futbol in Touloum Refugee camp, Chad. Sandra Cress MBA'88 with an orphans cooperative in Rwanda."},
{"SUBMISSION_DATE":"1/19/15","FIRST_NAME":"Bret","LAST_NAME":"Hadley","PROGRAM":"MBA","CLASS_YEAR":1988,"CLASS_NOTE":"Bret Hadley (MBA) is enjoying his third year leading his successful beauty industry venture, Roberts Cosmetics, in partnership with Cooper Roberts, the son of the founder. After years of stagnation, the business has had successive record years of sales and profits, reaching $20 million in 2014.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Joergen","LAST_NAME":"Bardenfleth","PROGRAM":"MBA","CLASS_YEAR":1989,"CLASS_NOTE":"After leaving Microsoft after 9 years and corporate America (HP, Intel, Microsoft) after 25 years, Joergen Bardenfleth (MBA) is now having a lot of fun with board work for high-tech companies in Copenhagen, including a bit of angel work and some public sector advisory work. Joergen writes, \"The independence and possibility of using some experience I've picked up the last 25 years is fun and rewarding. I'm hosting a dinner for 12 strangers, UCLA grads, this spring for the first time.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299217491671466849/J%C3%B8rgen%20B%20Tuborg%20H.jpg","PHOTO_1_CAPTION":"Joergen Bardenfleth","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/6/15","FIRST_NAME":"Nike","LAST_NAME":"Irvin","PROGRAM":"MBA","CLASS_YEAR":1989,"CLASS_NOTE":"Nike Irvin (MBA) is honored to travel as an alumni volunteer for YaleGale India. 20+ Yalies from all generations meeting with alumni from India's top universities to exchange on volunteerism, service, alum engagement. Nike observes, \"IIT-Madras (Chennai) and Bombay (Mumbai) and newbie Ashoka University─all impressive. Like UCLA, government funding has been important, but India's schools are pressed to build individual donor bases.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/298784279201889177/image.jpg","PHOTO_1_CAPTION":"Nike Irvin with participant in Chennai, India at YaleGale.","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Keith","LAST_NAME":"McWilliams","PROGRAM":"MBA","CLASS_YEAR":1989,"CLASS_NOTE":"Keith McWilliams (MBA) loved the 25th anniversary weekend last spring! Keith is head of the western region for Evercore Wealth Management after merging his firm, Mt. Eden Investment Advisors, with them in 2012. Keith is still peripherally involved in the wine grape business. He has two sets of twins, 18 year olds and 15 year olds, with the first two awaiting college acceptances eagerly. Keith says he plays keyboards in a band for balance!","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Michael","LAST_NAME":"Campbell","PROGRAM":"EXEC ED/CERT","CLASS_YEAR":1990,"CLASS_NOTE":"Michael Campbell (EXEC ED/CERT) sends his greetings! RA Power & Light is growing. Michael adds, \"Seeking top guns in energy and business in CA, NV, AZ to help us take the firm to the next level. Experience in enterprise software, energy, renewables, finance, sales and business development. Send us your CV for prompt consideration.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297263710351766019/7a4db000-8217-11e2-ac55-22000a93b214-large.jpg","PHOTO_1_CAPTION":"Michael Campbell shows a commercial solar deployment in Carlsbad, CA","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Eric","LAST_NAME":"Anders","PROGRAM":"MBA","CLASS_YEAR":1991,"CLASS_NOTE":"Eric Anders (MBA) announces, \"We're opening three new Wood Ranch BBQ & Grill restaurants this year: San Diego in April; Springfield, VA in May (our first Wood Ranch outside of CA); and Burbank in December. Please stop by if you get a chance.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299236538189944248/Elevation%202-6-15.pdf","PHOTO_1_CAPTION":"Eric Anders shares the Wood Ranch Burbank Preliminary Exterior Rendering","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Daniel","LAST_NAME":"Frigo","PROGRAM":"MBA","CLASS_YEAR":1991,"CLASS_NOTE":"In 2012 Daniel Frigo (MBA) was promoted to country manager of The Walt Disney Company, Italy. After 19 years at The Walt Disney Studios Morion Picture International Group, the previous four years as EVP and head of WDSMP Europe, Middle East and Africa, Daniel is now responsible for the oversight of all of the consolidated businesses of TWDC in Italy.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299219616541368476/image.jpg","PHOTO_1_CAPTION":"Daniel Frigo with his son Themis and wife Carie Karnezis Frigo (Anderson class of 1992)","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/25/15","FIRST_NAME":"Joseph","LAST_NAME":"Willenbrink","PROGRAM":"FEMBA","CLASS_YEAR":1991,"CLASS_NOTE":"Joseph Willenbrink (FEMBA) reports, \"I have launched a new business. www.MBADayLabor.com. I provide business services on a temporary basis. I can come in on short notice and perform a multitude of services from full-on senior management consulting to \"high-fallutin-Kelly-Girl\" type work. At this point, most of the work (including all of the senior level work) is being done by me, but I do have a small, erudite team of dedicated professionals who are available to come as needed. Neither the temp-services companies nor the overpriced \"McKinsey-type\" consulting firms offer anything quite like this! We are excelling at a boutique level-from analytical/financial to marketing to strategic planning and down to just Quick Books and clerical matters. That's my story; please hire me for a week or two! Then, when I am done, you can say, ‘Thank you very much! Now get the hell out of my office!!' www.MBADayLabor.com\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Robert","LAST_NAME":"Andersen","PROGRAM":"MBA","CLASS_YEAR":1992,"CLASS_NOTE":"Robert Andersen (MBA) was appointed EVP and CFO at Tessera Technologies (TSRA) in January 2014. Robert updates, \"Living in Piedmont, CA and married to my amazing wife Betsy. Our two girls just entered high school (Jane) and middle school (Ellie). Recently hosted a very lively \"Dinner for 12\" of 1991/1992 classmates that included David Cost (who provided bourbon and controversial comments), Todd Laurence, Dave Sherry, Lynn Holman, Vicki Shipkowitz, Derek Kozako, Natalie Yu and Shari Fujii. It was a wonderful evening!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Matsuo","LAST_NAME":"Iwata","PROGRAM":"MBA","CLASS_YEAR":1992,"CLASS_NOTE":"Matsuo Iwata (MBA) is former CEO of Starbucks Coffee Japan, and The Body Shop, Japan. Matsua is also part of CEO Leadership Consulting's CEO Inspirational Almuni 100. One of his books is best seller with over 320,000 copies sold.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297264575691338566/2006_07_10_%20024%20%281%29.jpg","PHOTO_1_CAPTION":"Matsuo Iwata","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/2/15","FIRST_NAME":"L Jasmine","LAST_NAME":"Kim","PROGRAM":"MBA","CLASS_YEAR":1992,"CLASS_NOTE":"L Jasmine Kim (MBA) shares, \"At our annual open house in December, several classmates gathered at our house to celebrate and to mark the end and beginning of a new year. Kirk Elder lives up the street and we went on a hike together in January; Chris Lange and I worked together on a consulting project recently with a mobile tech media (he having returned to the Bay Area from a 10 year exile in Redmond, WA); David Sherry, who still has the youthful face and form from our graduate school days, graced us with his presence; John Knightly and I sometimes cross paths as our kids go to the same school in San Francisco and those few times when he can take the kids to school on his long commute down to Hewlett Packard; Kathy Ullrich missed the party but she and I stay in touch through monthly calls and talks about Paris; Natalie Yu Henrich has been teaching kids in Oakland, and had traveled to Italy to celebrate her and her wonderful husband Ed Henrich's (UCLA Phd '91) anniversary last fall; Sheila Lee Dahlgren ('93) and I often chat for hours whenever we get together. Jennifer LeBlanc and I touched based in October, whenever she is in San Francisco from her home in mid Peninsula. Bart Schachter lives in the neighborhood with his two lovely daughters, and I just heard that David Cost is doing fine and building a weekend home (his wife is a talented architect) up in the Wine Country from a mutual friend. Lastly, even though he has moved away to La La Land, Samir Mehta and I touched based to mark and welcome the new year. Old friends are gold.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/28/15","FIRST_NAME":"Joseph","LAST_NAME":"Kraus","PROGRAM":"MBA","CLASS_YEAR":1992,"CLASS_NOTE":"In July 2014, Joseph Kraus (MBA) sold Stratis Business Systems to AOD Software in Coral Springs, FL after 15 years of building the business. Stratis provides home health care software solutions for CRM, scheduling, clinical point of care, and billing to more than 300 companies with 1,600 offices across the US, Canada and Australia.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Jennifer","LAST_NAME":"De Vore","PROGRAM":"MBA","CLASS_YEAR":1993,"CLASS_NOTE":"Jennifer De Vore (MBA) shares, \"Chris Bubser's son Sam Baron and my son, Nathaniel Feinstein, had their bar mitzvah together last November. The boys have been friends since birth, currently ski on the Mammoth ski team together and both did an amazing job. Paige Smith Orloff and Michael Chasalow celebrated with us!\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297264377719109686/image.jpg","PHOTO_1_CAPTION":"Jennifer De Vore' son and Chris Bubser's son","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/1/15","FIRST_NAME":"Ross","LAST_NAME":"Henderson","PROGRAM":"MBA","CLASS_YEAR":1993,"CLASS_NOTE":"Ross Henderson (MBA) proudly updates, \"Early this year I successfully completed my Kodanja 4th-degree black belt Master Instructor examination. This 5-day ‘round the clock' test is officially described as ‘not for the faint of heart' and jokingly referred to as ‘having the hot needle stuck in your eye.' For myself, I really appreciated and enjoyed the challenge as well as the camaraderie forged with my testing partners. My training and teaching continues, and I look forward to competing in the Tang Soo Do Internationals this summer.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/298611605542576580/REH%20Kodanja%202015.jpg","PHOTO_1_CAPTION":"Ross Henderson and a Jumping Back Fist","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Olivia","LAST_NAME":"Neece","PROGRAM":"MBA","CLASS_YEAR":1993,"CLASS_NOTE":"Olivia Neece (EMBA) and her husband Anthony have been managing their investment business together since 2009, after Tony retired from NBC-Universal (40 years) and Olivia retired from her interior design business and teaching finance at Cal State University Northridge. They now have four grandchildren. Olivia and Tony have increased their philanthropic efforts. Their major projects are assisting the Center Theatre Group, LA Opera-Opera Council, Center Dance Associates, several U.S. troop organizations including Operation Mend at UCLA. They are lifetime founders of the Music Center, LA County Museum of Art Curators Circle, as well as the historic restoration and operation of Battleship Iowa, three steam locomotives, and support for historical preservation nationally and in Los Angeles.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Michael","LAST_NAME":"Silberman","PROGRAM":"EMBA","CLASS_YEAR":1993,"CLASS_NOTE":"Michael Silberman (EMBA) is self-described as having a perennial fire in his belly to make things happen. Michael is now the co-founder, EVP and CFO of Mobile Corporation and has positioned his company to become a leading contender in the online mobile workforce space with the strategic goal of enabling workers to become economically productive online. He notes that he is burning the candle at both ends doing, what he refers to as, 'knowledge' wind sprints combined with good old-fashioned elbow grease. His son Max is a successful model (Elite Model Management) with a penchant for working in music videos (Lady Gaga, Muse, Wiz Khalifa, STORi et al) and his daughter Sabrina is waiting to hear back from all of her college applications. Sabrina singing with her high school a cappella group \"Unstrumental\" from Calabasas High School, at Carnegie Hall in late March!. All in all a very exciting time. Michael and his wife Stacey will be celebrating their 25th anniversary this year and looking forward to traveling the world.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297264328482424138/249990_1955812289926_2534332_n.jpg","PHOTO_1_CAPTION":"Michael Silberman and his wife Stacey","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/22/15","FIRST_NAME":"Tom","LAST_NAME":"Millhoff","PROGRAM":"MBA","CLASS_YEAR":1994,"CLASS_NOTE":"Tom Millhoff (MBA) is financing solar and storage projects and is seeking tax equity, debt and sponsor equity with attractive returns for low risk investments.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/22/15","FIRST_NAME":"Elaine","LAST_NAME":"Wood","PROGRAM":"MBA","CLASS_YEAR":1994,"CLASS_NOTE":"Elaine Wood (MBA) was named to the Board of Directors of the Mar Vista Chamber of Commerce.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Stephanie","LAST_NAME":"Kimmel","PROGRAM":"MBA","CLASS_YEAR":1995,"CLASS_NOTE":"Stephanie Kimmel (MBA) writes, \"Just attended a fabulous house concert at Ashley (MBA 95) and Rob Craig's (MBA 93) home with fellow UCLA alum Dan Navarro. Chicago alumni group going strong!\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299250487987507944/image.jpg","PHOTO_1_CAPTION":"Chicago alums are staying in touch: Stephanie Kimmel, Ashley and Rob Craig, and Dan Navarro.","PHOTO_2":"http://www.jotform.com/uploads/alumoff/22746332668157/299250487987507944/image11.jpg","PHOTO_2_CAPTION":"Chicago alums are staying in touch: Stephanie Kimmel, Ashley and Rob Craig, and Dan Navarro."},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Eileen","LAST_NAME":"McPeake","PROGRAM":"MBA","CLASS_YEAR":1995,"CLASS_NOTE":"Eileen McPeake (MBA) updates, \"I was recently promoted to vice president, investment advice at Rebalance IRA. We're following our Anderson finance professors' advice and putting clients into globally-diversified portfolios using low-cost ETFs, and charging only 0.5%. Learn more at www.rebalance-IRA.com.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"12/19/15","FIRST_NAME":"Roberto","LAST_NAME":"Medrano","PROGRAM":"EMBA","CLASS_YEAR":1995,"CLASS_NOTE":"SOA Software, an API Management and Cloud Integration leader that helps businesses accelerate their digital transformation by securely extending their reach across multiple channels, announced that Roberto Medrano (EMBA), its executive vice president, received an award from HITEC recognizing him as one of the top 100 Hispanic professionals in the information technology (IT) field and part of the HITEC 100 List. Candidates were rigorously evaluated on the basis of their achievements, responsibilities, positions, and contributions to the IT industry. Mr. Medrano has been instrumental in building SOA Software into one of the most respected makers of software for the management and security of APIs, a technology that is transforming the way that corporations build and integrate their most important software programs. \"It is an honor to be included in this prestigious list,\" said Roberto Medrano. \"Our technology and solutions at SOA Software are recognized as truly leading and visionary by our customers and most leading analysts, and I am proud to be part of this high achieving team.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/294839473912603124/_N2J8770%20copy.jpg","PHOTO_1_CAPTION":"Robert Medrano","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Jarl","LAST_NAME":"Pedersen","PROGRAM":"EXEC ED/CERT","CLASS_YEAR":1995,"CLASS_NOTE":"Jarl Pedersen (EXEC ED/CERT) is vice president of marketing and sales at NEST. Please check out this article on execution of strategic partnership agreement between the Norwegian technology start-up NEST and Aalborg CSP of Denmark. http://social.csptoday.com/technology/aalborg-csp-and-nest-develop-new-cost-effective-thermal-energy-storage-system","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299240043712158383/Svante%20Bundgaard%20%28Aalborg%20CSP%29%20and%20Jarl%20Pedersen%20%28NEST%29.jpg","PHOTO_1_CAPTION":"Svante Bundgaard, CEO, Aalborg CSP and Jarl Pedersen, Vice President of Marketing & Sales, NEST","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/6/15","FIRST_NAME":"Mike","LAST_NAME":"Ladge","PROGRAM":"MBA","CLASS_YEAR":1996,"CLASS_NOTE":"Mike Ladge (MBA) reminisces, \"It's hard to believe that it is been almost 19 years since we graduated but I feel lucky and blessed to be living in LA and driving by the Anderson School every day on my way to work. I was recently named a director to a newly formed Sports and Entertainment Division of Morgan Stanley in Beverly Hills so I look to continue to combine things I love to do. I also started playing competitive racquetball (yes, the sport is still around, lol) again after a successful elbow surgery a year ago and am doing well in the older guy divisions winning a few national titles. I recently took a trip to South America where I coached the current #2 player in the world and did a clinic for kids in Bolivia which was special and a great time. Still stay in touch with lots of Anderson alums and even had time to see Ashish Gupta when he gave me an hour notice to have lunch last week!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/5/15","FIRST_NAME":"Constantine","LAST_NAME":"Malaxos","PROGRAM":"MBA","CLASS_YEAR":1996,"CLASS_NOTE":"Constantine Malaxos (MBA) joyously announces, \"Maro and I welcomed our beautiful baby daughter Anastasia into the world. Please stop by if you are ever at the Jersey Shore. \"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/6/15","FIRST_NAME":"Jeff","LAST_NAME":"Platt","PROGRAM":"MBA","CLASS_YEAR":1996,"CLASS_NOTE":"Jeff Platt (MBA) greets, \"I hope all is well with everyone. I left the corporate world after 17 years and I joined Animoto, a SaaS-based start-up as the head of B2B marketing focused on DIY video creation for SMBs which is a space that is growing rapidly. I look forward to seeing everyone at our 20th reunion next year!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Aron","LAST_NAME":"Schwartz","PROGRAM":"MBA","CLASS_YEAR":1996,"CLASS_NOTE":"Aron Schwartz (MBA) is pleased to announce, \"I have joined ACON Investments in Washington, DC as a partner. We manage private equity funds across the Americas. Loving my new firm and new city! Please visit if you are in town.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Kristine","LAST_NAME":"Marin (Dale) Kawamura","PROGRAM":"FEMBA","CLASS_YEAR":1996,"CLASS_NOTE":"Kristine Marin (Dale) Kawamura (FEMBA) shares, \"My first book will be published in Spring (2015, by Emerald Publishing Group Limited. Written with co-author Simon Dolaon, it's called Cross-Cultural Competence: A Field Guide for Developing Global Leaders and Managers.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"12/23/14","FIRST_NAME":"Andy","LAST_NAME":"Frye","PROGRAM":"FEMBA","CLASS_YEAR":1997,"CLASS_NOTE":"All is well in Thailand for Andy Frye (FEMBA). \"It's now been 10 years in Asia. Angela, my wife and our three kids have adapted to the less developed world of Thailand from Singapore and Japan. The kids are doing well in the British schooling system. I continue to work throughout the 11 Asian countries we operate in, so travel is frequent. I just returned from Yangon, it's amazing to see the growth (and traffic) as one of the last frontier markets in Asia opens up. After leaving Abbott in 2011 to join DKSH as vice president, business development, I am now leading the healthcare business here in Asia. It's quite engaging as we register, sell, and distribute products in these markets for all MNC healthcare companies as well as license and own our own brands. Best wishes from Asia.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"David","LAST_NAME":"Haubert","PROGRAM":"FEMBA","CLASS_YEAR":1997,"CLASS_NOTE":"David Haubert (FEMBA) relates, \"It's hard to believe it has been so long! Does anyone remember our international field trip to Vevey, Switzerland and the Nestle project? I'm loving life as a start-up advisor to several tech companies and I recently ran for mayor of Dublin, CA and won by a landslide. So, if you are in NorCal look me up!\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299229505622184450/haubert_pic.bmp","PHOTO_1_CAPTION":"David Haubert. Mayor of Dublin, CA","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Richard","LAST_NAME":"Henson","PROGRAM":"EXEC ED/CERT","CLASS_YEAR":1997,"CLASS_NOTE":"Richard Henson (EXEC ED/CERT) writes, \"After founding PhageTech in 2014, based on innovative diagnostic sensor technology developed at UCI, we will be launching our first patient trial this year at UC Irvine Medical Center to test patient urine for bladder cancer. This will be the first of hundreds of tests that will ultimately be used globally for infectious diseases, cancers, and other applications. www.PhageTech.com.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297316625436491740/Penner%20Lab.tif","PHOTO_1_CAPTION":"Richard Henson and crew at Penner Lab at UC Irvine","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/20/15","FIRST_NAME":"Jason","LAST_NAME":"Knapp","PROGRAM":"MBA","CLASS_YEAR":1998,"CLASS_NOTE":"Jason Knapp (MBA) had a blast speaking at the CES@Anderson HTBA/Easton event recently. Jason writes, \"It brought back lots of memories. I recently took on the title of chief product officer at Viant where I have worked in Irvine for four years. Sara and the kids are wonderful and we're enjoying lots of travel now that they are older, including just getting back from Africa this last summer.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297598238864107028/talk.%20%281%29.jpg","PHOTO_1_CAPTION":"Jason Knapp speaking at CES@Anderson, January 2015","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Intesar","LAST_NAME":"Haider","PROGRAM":"MBA","CLASS_YEAR":1999,"CLASS_NOTE":"Intesar Haider (MBA) gratefully writes, \"Thank you, once again, to the class of '99 for setting an Anderson participation record for giving. As a class we donated $185,607.59 and had a participation rate of 72.3% for fiscal year 2014! Let us keep up the momentum in 2015. On a professional note, I have finally decided to go out on my own. I, along with a couple of partners, have set up a hedge fund, Vinson Capital Management, to invest in structured credit assets. I continue to be based in New York City and I encourage you all to look me up if your travels bring you to New York.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Steve","LAST_NAME":"Krause","PROGRAM":"MBA","CLASS_YEAR":1999,"CLASS_NOTE":"Steve Krause (MBA) updates, \"Going on two years as an analyst focused on event-driven value investing (with my angle being mostly legal and more specifically bankruptcy or other restructuring when possible). We moved to Bronxville this year. And, in timely news, I started a robotics team here with my daughters and they qualified for the city championship! Yay! And my co-coach's wife is also an Anderson grad. Let's get a NYC get-together going soon!\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299226108402655479/image.jpg","PHOTO_1_CAPTION":"Steve Krause's Bronxville Bookworms First Lego League team","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Sanjay","LAST_NAME":"Nath","PROGRAM":"MBA","CLASS_YEAR":1999,"CLASS_NOTE":"Sanjay Nath (MBA) greets, \"Hi '99 Andersonites! Its been a while since my last update. I'm pleased to share the now four-year-old VC Fund, Blume Ventures (www.blumeventures.com) that I co founded with my partner Karthik Reddy, has emerged as one of India's leading tech seed funds. Our fast growing portfolio includes Zipdial (acquired by Twitter), Little Eye Labs (Facebook), Taxiforsure (acquired by Ola Cabs), Grey Orange Robotics, and many others. Its been 4.5 years since we left San Francisco and relocated \"home\" to Mumbai. My wife, Dr Roopa Andhare-Nath, pursues work as a biotech and healthcare advisor and angel investor, and our son Rohan (12 years old) is in Grade 6 at the American School in Bombay. We do miss California and try and get there every summer and more often for work. Hey all the India Andersonites, look forward to catching up soon!\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299227514241502291/Sanjay%20Pic.jpg","PHOTO_1_CAPTION":"Sanjay Nath","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Greg","LAST_NAME":"Scheuffele","PROGRAM":"MBA","CLASS_YEAR":1999,"CLASS_NOTE":"Greg Scheuffele (MBA) updates, \"In January 2015 I changed jobs, joining Cognizant as a director and client partner in their communications and high tech vertical. In August 2014 I met up with several alums from the classes of 1998 and 1999 at Eleanore Dogan's summer BBQ at her house, it was really great seeing everyone.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Kerri","LAST_NAME":"Fox","PROGRAM":"EMBA","CLASS_YEAR":1999,"CLASS_NOTE":"Kerri Fox (EMBA) recounts, \"The EMBA 1999 class met January 10 at Wokcano in Santa Monica to celebrate our 15-year reunion. Close to 25 people gathered for a fun night of cocktails, appetizers, reminiscing, and laughter. There is talk of a follow-up get-together later this year. We ask all classmates to make sure their e-mail is connected to the Anderson database to ensure an even bigger turnout next time.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Joshua","LAST_NAME":"Li","PROGRAM":"MBA","CLASS_YEAR":2000,"CLASS_NOTE":"Joshua Li (MBA) updates, \"I've just transferred in our to Google X division as the Asia Pacific regional business lead for Google X. My role is to negotiate and sign deals to bring Google X technologies to APAC.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Ritesh","LAST_NAME":"Patel","PROGRAM":"MBA","CLASS_YEAR":2000,"CLASS_NOTE":"Ritesh Patel (MBA) reports, \"I have been with Virtu Investments now for 12 years, buying apartments with private equity. We just hit a big milestone, buying our 100th property. Outside work, I am living the good life in San Diego, with my wife Priya. I live at the beach in Solana Beach , bike to work a couple times a week along the coast to Carlsbad, and play tennis regularly. I do like audiobooks, so I started a nonfiction book club a couple years ago. It ended up that it has my Anderson buddies in it─Matt Chittle, Jerome Farmer, Bill Trebasky, and Ken Stimeling, even Tom Mercer joins from Denver, via Skype. Priya has been the only non-Anderson member. It has been really great. Beyond that I do meet with John Langley who lives nearby. I am in touch with, and did meet with Tim Driscoll a few months ago. It was great to meet with Ganesh Nair who was in town for a conference last month. Look forward to this year's 15-year reunion. If anyone is in town do get in touch.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Collin","LAST_NAME":"Agee","PROGRAM":"EXEC ED/CERT","CLASS_YEAR":2000,"CLASS_NOTE":"Collin Agee (EXEC ED/CERT) shares, \"I retired from the Army in 2000 but continued the connection as an Army civilian, including spending 2008 in Baghdad. I'm currently the Army's senior adviser for Intelligence Community (IC) Engagement, in the Pentagon. On the side, I'm a high school baseball umpire.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297308175480352208/Collin%20%26%20Melody.jpg","PHOTO_1_CAPTION":"Collin and Melody Agee attending a concert at Wolftrap","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Jeff","LAST_NAME":"Diener","PROGRAM":"MBA","CLASS_YEAR":2001,"CLASS_NOTE":"Jeff Diener (MBA) announces, \"By the time this is printed, my family and I should be settled into San Francisco after three wonderful years in London. Included in our list of accomplished London activities was adding a fourth child to our clan (we seem to have one every time we move) and building upon an already great platform in Europe. Still with the same firm, a decade in and four ports of call. I look forward to catching up with Anderson friends in SF.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Jeff","LAST_NAME":"Hassannia","PROGRAM":"FEMBA","CLASS_YEAR":2001,"CLASS_NOTE":"Jeff Hassannia (FEMBA) joined Cobham (a large British aerospace and defense technology company) in late 2013. Currently Jeff is senior vice president of business development and technology, managing a portfolio technologies for the defense and commercial markets. He lives in Annapolis, MD with his two children","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Thomas","LAST_NAME":"Nimmer","PROGRAM":"FEMBA","CLASS_YEAR":2001,"CLASS_NOTE":"Thomas Nimmer (FEMBA) is living in Short Hills, NJ and celebrating three years with Novartis. Thomas admits missing SoCal weather, but is enjoying New York City and Anderson Alumni East.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/29/15","FIRST_NAME":"Adam","LAST_NAME":"Hertzman","PROGRAM":"MBA","CLASS_YEAR":2002,"CLASS_NOTE":"Adam Hertzman (MBA) has just started a new job as director of marketing for Jewish Federation of Greater Pittsburgh. He shares, \"Moving into the community benefit organization space from the technology world has been challenging but rewarding. We will celebrate Noah's bar mitzvah on \"Pi Day\" (3-14-15), and we'll be in New York towards the end of June to see him play with his youth symphony at Carnegie Hall. Jonah is looking forward to trying out for the symphony with oboe as well. Please look us up if you are in Pittsburgh!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/27/15","FIRST_NAME":"Erika","LAST_NAME":"Hayflick Lowe","PROGRAM":"MBA","CLASS_YEAR":2002,"CLASS_NOTE":"Erika Hayflick Lowe (MBA) updates, \"It's been a long time. I've been at PIMCO since 2006 and in Newport Beach since 2008. In my spare time I'm playing golf with my partner Mark, traveling around the world, climbing in Colorado, exercising, playing with my niece Lilah, learning about wine. Life is very full and busy, but overall, I'm grateful for the many, many blessings, big and small. Would be great to reconnect with you!\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/298213536452623485/Erika_Elbert_2014.jpg","PHOTO_1_CAPTION":"Erika Hayflick Lowe on summit of Mt Elbert-14,440'-August 2014","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"12/18/14","FIRST_NAME":"Suresh","LAST_NAME":"Pillay","PROGRAM":"EMBA","CLASS_YEAR":2002,"CLASS_NOTE":"Suresh Pillay (EMBA) was happy to attend of the annual EMBA 2002 holiday dinner organized by Mike Sammis.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/294749886922763083/image.jpg","PHOTO_1_CAPTION":"EMBA 2002 Holiday Dinner","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Amir","LAST_NAME":"Blachman","PROGRAM":"MBA","CLASS_YEAR":2003,"CLASS_NOTE":"Amir Blachman (MBA) took his girlfriend Cici on a surprise trip to Paris and, on a boat tour beneath the Eiffel Tower, got down on one knee. Thankfully Cici said, \"Yes!\" With Cici's great support, Amir focused the last few years on aerospace investment. He is now a partner and managing director at Space Angels Network, fueling the new space race (19 companies launched and #20 is on the pad). Of note, he recently took Angels in his network to kick the thrusters at SpaceX, Virgin Galactic, XCOR Aerospace, and Astrobotic Technologies. Amir says, \"Playing a part in pushing our scientific limits and supporting people with explorers' hearts and diligent minds is why I chose this vibrant path.\" His personal motto lately is, \"Carpe astra!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/6/15","FIRST_NAME":"Nitya","LAST_NAME":"Kirat","PROGRAM":"MBA","CLASS_YEAR":2003,"CLASS_NOTE":"Nitya Kirat (MBA) shares, \"The year has gotten off to a fast start with a lot of travel (mostly work, some fun). I am going into my fifth year of working with Anderson classmate Adam Shaivitz as we help companies improve sales team effectiveness. When I am in town, it's always nice to catch up with classmates and it was great to see such a large 2003 turnout at the LA-chapter kickoff party. Like a fine wine, these guys just get better with age.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299048280081996290/20150128_190606.jpg","PHOTO_1_CAPTION":"2003 representing at the LA Anderson Kickoff party at Mr C.","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Alison","LAST_NAME":"Wolk Campbell","PROGRAM":"MBA","CLASS_YEAR":2003,"CLASS_NOTE":"Alison Wolk Campbell (MBA), Marc Campbell (MBA), and newly appointed big brother Cooper welcomed a new member of the family this year. Born on August 21, 2014, Hannah Grace Annedriella Campbell has added a new dimension and tons of laughter, love, and joy to our family. In other news, Marc opened the Santa Monica office for TCI Wealth Advisors and recently became a partner. His work focuses on the intersection of wealth management and the science of happiness. You can follow him at @your_bigpicture. In addition to growing a baby, Ali completed a Master's program in spiritual psychology at the University of Santa Monica, and wrote a first draft of a book. She's now intending to take as long of a maternity leave as possible!","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299259441451433570/IMG_20150131_192234077_HDR.jpg","PHOTO_1_CAPTION":"Alison and Marc Campbell's son Cooper and daughter Hannah Grace Annedriella","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Carrie","LAST_NAME":"Friedman","PROGRAM":"MBA","CLASS_YEAR":2003,"CLASS_NOTE":"Carrie Friedman (MBA) happily announces, \"In October 2014, I welcomed my son, Nathan Sander Friedman, into the world! We are both adjusting well to our new life together.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299218902214161410/image.jpg","PHOTO_1_CAPTION":"Carrie Friedman with son Nathan","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/6/15","FIRST_NAME":"June","LAST_NAME":"Fujimoto","PROGRAM":"MBA","CLASS_YEAR":2003,"CLASS_NOTE":"June Fujimoto (MBA) is excited to announce the arrival of her identical twin girls, Sienna and Violet, who were born 6 weeks early on Oct. 22, 2014 weighing 5lb 7oz and 4lb 4oz.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/298805786551275483/June%20Fujimoto.jpg","PHOTO_1_CAPTION":"June Fujimoto's twins, Sienna and Violet ( 2.5 weeks old)","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Monica","LAST_NAME":"(Schaul) McClure","PROGRAM":"MBA","CLASS_YEAR":2003,"CLASS_NOTE":"Monica (Schaul) McClure (MBA) and her husband, Walt, were thrilled to welcome Chloe Avery McClure into the world on September 5, 2014. Chloe's hobbies include tummy time, nursing, and eating her hands.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299220024431112103/image.jpg","PHOTO_1_CAPTION":"Monica and Walt McClure's baby girl Chloe","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/6/15","FIRST_NAME":"Julio","LAST_NAME":"Morales","PROGRAM":"MBA","CLASS_YEAR":2003,"CLASS_NOTE":"Julio Morales (MBA) left California and life as city manager this Janaury. He updates, \"I am now working for the U.S. Treasury Deparment providing technical assistance to the treasurer in Paraguay. Moved wife, child, and two cats to Paraguay last week─quite an adventure.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Kelly","LAST_NAME":"(Trotter) King","PROGRAM":"FEMBA","CLASS_YEAR":2003,"CLASS_NOTE":"Kelly (Trotter) King (FEMBA) and her husband, John, welcomed their son, Grayson, into the world on June 18th. Grayson keeps mom and dad on their toes and although he looks much like daddy, he also has mommy's baby blues. Kelly is enjoying motherhood but still manages to keep her education company, Generation Think, at the top of the SoCal short list of tutoring/test prep companies. If Gray only knew the benefit of the free tutoring that will come his way in the years to come!","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297280733766735487/image.jpg","PHOTO_1_CAPTION":"Kelly (Trotter) King with husband John and son Grayson at Four Seasons (Hualalai) in Kona, Hawaii","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"James","LAST_NAME":"Pickell","PROGRAM":"FEMBA","CLASS_YEAR":2003,"CLASS_NOTE":"After exiting his start-up OpenEnglish.com, the world's largest online language school, James Pickell (FEMBA) assumed a role at HomeExchange.com where he is now president. He is living in Newport Beach, California with his wife and their five-year-old son and two-year-old daughter. He hopes everyone is well and would love to reconnect.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299316706851118821/P1050234.jpg","PHOTO_1_CAPTION":"James Pickell and family","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Spencer","LAST_NAME":"Wolf","PROGRAM":"FEMBA","CLASS_YEAR":2003,"CLASS_NOTE":"Spencer Wolf (FEMBA) happily shares, \"I'm excited to announce that my new book, After Mind, is launching worldwide on March 25. Advance reader reviews have been terrific and an excerpt has already won an award. I'd love to support the Anderson community so if anyone wants a free eBook copy, contact me at www.SpencerWolf.com and I'll send you one!\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299219591981843905/After%20Mind%20-%20Cover%20-%20FINAL.jpg","PHOTO_1_CAPTION":"After Mind by Spencer Wolf","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Andrew","LAST_NAME":"Coulter","PROGRAM":"EXEC ED/CERT","CLASS_YEAR":2003,"CLASS_NOTE":"All is well for Andrew Coulter (EXEC ED/CERT). He has six years now at Oppenheimer & Co. Inc. as a stock and bond broker.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/7/15","FIRST_NAME":"Jason","LAST_NAME":"Myhill","PROGRAM":"EXCH","CLASS_YEAR":2003,"CLASS_NOTE":"Jason Myhill (EXCH) shares, \"It is the fifth year of operation for Lumi LED Lights (Pty) Ltd in South Africa which was a brand new startup in 2010. I am the director and investor in this e-commerce venture www.led-lights.co.za. It is now ready to fly!\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299146797113894021/lumiStripsPonte.jpg","PHOTO_1_CAPTION":"Jason Myhill, director of Lumi LED Lights, shows the lights supplied for a large outdoor media event.","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Sean","LAST_NAME":"Brooks","PROGRAM":"MBA","CLASS_YEAR":2004,"CLASS_NOTE":"Sean Brooks (MBA) was included in the San Francisco Business Times's 40 under 40, Class of 2015. Check out this great accomplishment: http://www.bizjournals.com/sanfrancisco/blog/2015/02/40-under-40-2015-tech-san-francisco-box-twitter.html?ana=e_sfbt_rdup&s=newsletter&ed=2015-02-09&u=ulzRv2S5ejhi6OuVnR3HJg012df9e8&t=1423498882","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/22/15","FIRST_NAME":"Sean","LAST_NAME":"Crowley","PROGRAM":"MBA","CLASS_YEAR":2004,"CLASS_NOTE":"Sean Crowley (MBA) opened a San Franciso branch of his mortgage business. He is one of the most successful mortgage lenders in San Francisco.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297784973292709027/headshot.png","PHOTO_1_CAPTION":"Sean Crowley","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Lindsey","LAST_NAME":"(Zuckerman) Viscomi","PROGRAM":"MBA","CLASS_YEAR":2004,"CLASS_NOTE":"Lindsey (Zuckerman) Viscomi (MBA), her husband Jeff, and daughter Gemma welcomed Francesca Morgan Viscomi to the family on January 9, 2015, in Atlanta. The family is overjoyed and already in love with little Frankie!","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299219510491748023/DSC_6314.jpg","PHOTO_1_CAPTION":"Lindsey (Zuckerman) Viscomi, Jeff, Gemma, and Frankie","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Hwa","LAST_NAME":"Kho","PROGRAM":"EMBA","CLASS_YEAR":2004,"CLASS_NOTE":"Hwa Kho (EMBA) announces, \"EMBA 2004 Class Reunion to be held in the beautiful mountain resort of Idyllwild, CA, on May 23-24, 2015. The event, hosted by alum Sam Ahn, MD, will include panel discussions on topical events, barbecue, and hikes in the mountain. It will be an informal, fun, and informative function for classmates to catch up and network. Families are very welcome. There are no fees for the function and all food and refreshments will be provided. For more information, please contact Hwa Kho at hwa.kho.2004@anderson.ucla.edu or Sam Ahn at sam.ahn.2004@anderson.ucla.edu. Volunteers to help organize are very welcome!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/6/15","FIRST_NAME":"Stuart","LAST_NAME":"Davidson","PROGRAM":"MBA","CLASS_YEAR":2005,"CLASS_NOTE":"Stuart Davidson (MBA) shares, \"I'm living in Atlanta with my wife, Stacy, and our son, William, who will be five in May. About to finish my sixth year at Delta Air Lines, where we've managed","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/28/15","FIRST_NAME":"Brian","LAST_NAME":"Feeney","PROGRAM":"MBA","CLASS_YEAR":2005,"CLASS_NOTE":"Brian Feeney (MBA) and his family (wife Allison and three children) successfully returned to Portland, OR after a one-year work assignment in Los Angeles. While it was nice to enjoy year-round sun, frequent trips to Zuma beach, and reconnecting with Anderson classmates, they are thrilled to be back home. Brian is the senior director, worldwide SME channel, at Aruba Networks.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/5/15","FIRST_NAME":"Austin","LAST_NAME":"Katz","PROGRAM":"MBA","CLASS_YEAR":2005,"CLASS_NOTE":"Austin Katz (MBA) has joined The Ebersol Lanigan Company (known as The Company) as chief operating officer in November 2104. Austin writes, \"The Company is known for developing and producing unscripted television series; most notably The Profit on CNBC. I currently live in LA with my wife, Alli, and my two children, Walker (5) and Presley (4).\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299067340031213088/ACK%20Headshot%202014.jpeg","PHOTO_1_CAPTION":"Austin Katz","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Mattan","LAST_NAME":"Lurie","PROGRAM":"MBA","CLASS_YEAR":2005,"CLASS_NOTE":"Mattan Lurie (MBA) and his wife Grace Gao are anticipating the birth of their first child, a boy, due to arrive around May 1. Very excited!","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299217845661412312/20150102_160752.jpg","PHOTO_1_CAPTION":"Mattan Lurie and wife Grace Gao on \"Babymoon\" in China","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Michelle","LAST_NAME":"Mathis","PROGRAM":"MBA","CLASS_YEAR":2005,"CLASS_NOTE":"Michelle Mathis (MBA) has lived in San Francisco since 2008, where she leads the UCLA Anderson Bay Area Alumni Network. She recently started working at Funny Or Die as the director of marketing. In April 2014, she married Seth Weil in a small ceremony at San Francisco City Hall.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/18/15","FIRST_NAME":"Wayne","LAST_NAME":"Koizumi","PROGRAM":"FEMBA","CLASS_YEAR":2005,"CLASS_NOTE":"Wayne Koizumi (FEMBA) has switched from Disney Studio Technology to the Disney ABC Television Group, and was promoted to senior program manager of the ABC WATCH portfolio.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Richard","LAST_NAME":"Low","PROGRAM":"EMBA","CLASS_YEAR":2005,"CLASS_NOTE":"Richard Low (EMBA) updates, \"I'm still living in Santa Barbara, working as the vice president for Sientra, Inc., a medical device manufacturer in aesthetics. In October, we successfully took our company public with an IPO on Nasdaq (SIEN) which was an incredible experience. The Nasdaq team does an incredible job of orchestrating the IPO process. Getting to walk into Times Square to see the Sientra brand on their massive light board was a marketer's dream. Looking forward to big things in the coming year!\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299313965812688548/mo_102914085-3653052845-O.jpg","PHOTO_1_CAPTION":"Richard Low on IPO DAY at Nasdaq with Hani Zeini, Founder and CEO of Sientra.","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Leo","LAST_NAME":"Dencik","PROGRAM":"MBA","CLASS_YEAR":2006,"CLASS_NOTE":"Leo Dencik (MBA) shares, \"I recently entered the start-up world and joined India Hicks as finance director. The company offers an exclusive range of well-crafted gifts, fragrances, and accessories directly into the heart of the home, by selling these collections through networks of entrepreneurial women and our dynamic e-commerce site.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Cody","LAST_NAME":"Winn","PROGRAM":"MBA","CLASS_YEAR":2006,"CLASS_NOTE":"Cody Winn (MBA) has moved to Berlin, Germany to manage product/UX for Hem, a spinoff of fab.com, focusing on furniture and home decor designed and manufactured in Europe.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Amy","LAST_NAME":"Galland","PROGRAM":"FEMBA","CLASS_YEAR":2006,"CLASS_NOTE":"Amy Galland (FEMBA) is excited to announce, \"I launched my first app, Plume, in February. It's a flirting app─super fun, I think you'll love it! Check us out! www.theplumeapp.com.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299220964801319390/isotype%20purple.png","PHOTO_1_CAPTION":"Amy Galland's new app logo, Plume","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Rayne","LAST_NAME":"Guest","PROGRAM":"CERT","CLASS_YEAR":2006,"CLASS_NOTE":"Rayne Guest (CERT) moved to Texas in late 2012 to set up an R&D and manufacturing company, R-Water. Her patented electrochemical generation and delivery system became available in the market late-January 2015. The system produces disinfecting and cleaning chemicals using only water, electricity and salt: www.r-water.com.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299247321391286628/blue%20DSC_0132.jpg","PHOTO_1_CAPTION":"Ryan Guest","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Deepak","LAST_NAME":"Thakral","PROGRAM":"FEMBA","CLASS_YEAR":2007,"CLASS_NOTE":"Deepak Thakral (FEMBA) recently moved with his family to the San Francisco Bay area to join Quixey, a start-up based in Mountain View, CA as VP of monetization. He writes, \"Its a big change after living in LA for 15 years but my 8-year-old son, Eshaan loves his new school and 2-year-old daughter, Anaya, is making new friends in her pre-school. I would love to catch-up with Anderson alum especially FEMBA '07s in the Bay Area.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299252798631938159/Deepak%20Thakral%201.jpg","PHOTO_1_CAPTION":"Deepak Thakral","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Josh","LAST_NAME":"Fields","PROGRAM":"MBA","CLASS_YEAR":2008,"CLASS_NOTE":"Josh Fields (MBA) married Jessica Pearlman on December 28, 2014!","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297267109091612641/Josh%20Fields%20-%20wedding%20pic.jpg","PHOTO_1_CAPTION":"Josh Fields and Jessica Pearlman wed","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/24/15","FIRST_NAME":"Estela","LAST_NAME":"Wolf Levin","PROGRAM":"MBA","CLASS_YEAR":2008,"CLASS_NOTE":"Estela Wolf Levin (MBA) and Daniel Levin welcomed their first child, Zachary, into the world on October 7, 2014. Zachary is such an alert, expressive and sweet little boy.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297893073425320406/janbirch.comIMG_1228.jpg","PHOTO_1_CAPTION":"Estela and Daniel with new baby Zachary","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"12/31/14","FIRST_NAME":"Elizabeth","LAST_NAME":"Azmoodeh","PROGRAM":"FEMBA","CLASS_YEAR":2008,"CLASS_NOTE":"Elizabeth Azmoodeh (FEMBA) updates, \"After graduation, I joined Raytheon's Executive Development Program. Stayed 4+ years with the company and decided I wanted to join the federal work force and have been working for DOD/DIA. I've also moved to the east coast . . . missing my city, my home, my UCLA a lot but you have to go where life takes you. The stagnate water turns into a swamp.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Michael","LAST_NAME":"Converse","PROGRAM":"MBA","CLASS_YEAR":2009,"CLASS_NOTE":"Michael Converse (MBA) shares, \"Greetings all! I recently started working in corporate strategy at AECOM. It felt like a big move to leave Deloitte Consulting─and all the UCLA Anderson alums there─but I'm loving the new challenge.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Bruce","LAST_NAME":"Brooks","PROGRAM":"FEMBA","CLASS_YEAR":2009,"CLASS_NOTE":"Bruce Brooks (EMBA) updates, \"Shortly after graduation from Anderson, I became the general counsel and corporate secretary of a social commerce/technology start-up based in Pittsburgh and then Seattle. Though the business did not remain on the desired trajectory, it was an amazing and fast-paced ride that allowed me to put to use both business and legal skills. After a stint providing management consulting to a small business and in-house legal services to a separate business, I am pleased to announce that I once again have merged my business and legal backgrounds. In February 2015, I joined Garvey Schubert Barer, a full-service, business law firm with offices in Seattle, New York, Washington, DC, Portland, Anchorage and Beijing, as executive director, strategy and client initiatives. Though this work will reach across the firm's offices, practice areas, and operations, our family still will be able to call Seattle home.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Audrey","LAST_NAME":"Anhood","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Audrey Anhood (MBA) can't believe it's been five years since graduation! She writes, \"I definitely miss hanging out in the Anderson courtyard, free food and beer at Anderson afternoons and 3-day weekends! So quick recap on the last five years: after living in New York City for two years, Himanshu and I returned to LA, got married in India in 2013, and bought a house in Beverlywood last year. I'm still working in operations and strategy at a midsize manufacturing company, but I'm not letting go of my dream to start my own company (TBD!). I'm really looking forward to seeing you all at our reunion on May 2-I'll be 8.5 months pregnant then, so if I can rally, so can you!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"David","LAST_NAME":"Bhattacharyya","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"David Bhattacharyya (MBA) shares, \"After three years in M&A investment banking, I joined Airbnb, a hospitality start-up in San Francisco. It's unlike any other company I've worked for and I'm learning a lot and meeting a ton of great people. Looking forward to seeing everyone at the reunion!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Giancarlo","LAST_NAME":"Brutocao","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Giancarlo Brutocao (MBA) happily declares, \"My son likes to beat deadlines─we welcomed Wesley Tutt Brutocao into the world on 2/7/15, just in time for Class Notes.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Lea","LAST_NAME":"Oliver-Gelwicks","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Lea Oliver-Gelwicks (MBA) now lives in San Francisco and works in finance for a large INGO called Room to Read. She continues to love international travel and feels lucky that the past few years have included work trips to Sri Lanka, India, Cambodia, and Indonesia, followed by Nepal next month. Last year, she married long-term \"Sig-O\" Eric Gelwicks who also shares her love of soccer, active exploring, and nights out in the city. Lea hopes to attend the reunion in May!","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"Sonia","LAST_NAME":"Benavides Haendel","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Sonia Benavides Haendel (MBA) and Greg Haendel ('03) welcomed their first daughter last August 2014. Greg is senior portfolio manager at Bradford & Marzec, while Sonia is pursuing entrepreneurial ventures to launch in fall 2015! Tatiana Benavides Haendel born August 8th, 2014.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Andrew","LAST_NAME":"Hunt","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Andrew Hunt (MBA) with his wife Kiana Anvaripour welcomed to the world a baby girl, Ava June Hunt, on August 24, 2014.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/6/15","FIRST_NAME":"Saman","LAST_NAME":"Bravo-Karimi","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Saman Bravo-Karimi (MBA) adds more good news, \"My wife Julia and I welcomed our first child, our son Joaquin, in March of 2014. I have been at the Los Angeles Unified School District for over three years now, transitioning recently from the budget department to the bond finance team.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/3/15","FIRST_NAME":"Jessica","LAST_NAME":"Kellett","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Jessica Kellett (MBA) updates, \"I am working at Southern California Edison managing social media and digital advertising. Last fall I got engaged to my fiancé Drew in Hawaii. We are planning to get married locally near our home in Hermosa Beach in the early summer.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/298974364921824008/jess%20drew%20cedar.jpg","PHOTO_1_CAPTION":"Jessica Kellett and fiancé Drew in Tahoe with their dog Cedar","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Jessica","LAST_NAME":"Kimiabakhsh","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Jessica Kimiabakhsh (MBA) is a brand and integrated marketing strategist, consulting with various start-ups in tech and lifestyle. She is currently working on her own venture, www.furthermore.guru, an online curriculum and resource for relationship exploration.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/19/15","FIRST_NAME":"Rebecca","LAST_NAME":"Mall","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Rebecca Mall (MBA) and John Miller (MBA) are thrilled to announce the arrival of their twins, Levi and Lola Miller, on January 10, 2015! They are the latest of many Ander-babies who will be raised around many more offspring of Anderson couples. Rebecca states, \"We are very much in love, despite being massively sleep deprived!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/5/15","FIRST_NAME":"Andrew","LAST_NAME":"Martin","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"In June, Andrew Martin (MBA) was married to his beloved Rachel. In October, Andy Brantner (2010) and Andrew sold their Menchie's Frozen Yogurt 11 locations. Andrew and Andy are now looking to own and operate another consumer-based or internet-based business, and are open to ideas. They wish they could make it to the reunion. Alas.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/298992443771272340/10339399_10100412968062484_1348481754105876759_o.jpg","PHOTO_1_CAPTION":"Andrew and Rachel Martin","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/10/15","FIRST_NAME":"David","LAST_NAME":"Nielsen","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"David Nielsen (MBA) writes, \"A lot has happened since we were together nearly five years ago, so updates are in order. Since my days as a member of the IFA, I have been investing in fixed-income products as a portfolio manager at Ensign Peak Advisors, a Salt Lake City shop, focusing on emerging markets. For you fellow EA members, not to worry, I keep flexing my entrepreneurial muscles having co-founded a start-up in June 2012, which, after several years of development, landed our first institutional client in February. But perhaps more important, in our free time my eldest son Gavin and I have been tirelessly working together with grandpa to finish the restoration of a classic 1970 VW Beetle. Karly and the rest of the clan are happy and steadily getting older.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Jackson","LAST_NAME":"Pan","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Jackson Pan (MBA) has launched a new, free iOS app \"Nom Nom Eat\"; an Instagram for food with Yelp functionality to discover, socialize, share, and eat. Find it at nomnomeat.com or iTunes. In his spare time, Jackson continues to work long hours at Oracle in LA developing/managing Cloud products and enterprise apps.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299172024452566309/180icon.png","PHOTO_1_CAPTION":"Jackson Pan's app, Nom Nom Eat","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/22/15","FIRST_NAME":"Dan","LAST_NAME":"Russ","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Dan Russ (MBA) shares, \"A few years ago my best friend, Gal, was diagnosed with ALS (also known as Lou Gehrig disease). Gal is an experienced software developer, and we decided to go on a journey and develop a new low-cost, fully featured, multilingual, on-screen keyboard that would help disabled individuals use a PC/tablet. After six years in LA, I moved back to Israel with my wife and kids, and am currently working on this project full time, trying to get it off the ground. We already have a Windows beta version and several hundred users who provide us with invaluable feedback (Steve Gleason among others). We work closely with Swiftkey, bringing their ground breaking technology into our arena. Gal writes the code─most of it using only his eyes, and I am entrusted with everything else: detail design, market research, quality assurance, general management . . . hopefully we'll be able to secure a seed investment and continue full steam ahead. We have three phases planned: the first to enable full control over the PC/tablet; the second to control electronics via infrared (i.e. TV, set top box) from the PC; and third to control the above mentioned devices through our software using brainwaves (brain computer integration). We will have a prototype for the brainwaves control later this year, it's pretty cool. An item on our company aired a few months ago on BBC. Check it out on our website: www.click2speak.net . Anyone who wants to help or who's interested in more details can contact us.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297724789811992871/IMG_2468-2.jpg","PHOTO_1_CAPTION":"Gal (left) and Dan Russ","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Shelley","LAST_NAME":"Schwartz","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Shelley Schwartz (MBA) is finishing her medical residency in internal medicine at Harbor-UCLA Medical Center. She will start working as a hospitalist when she is done. She just had her third child. Shelley lives in Los Angeles with her husband, Jacob, and three beautiful children.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Scott","LAST_NAME":"Swisher","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Scott Swisher (MBA) and wife, Alison, moved to the Bay Area in 2013 and settled down in Burlingame. Scott joyously shares, \"In October 2013, we welcomed our son, Landon, into the world, which has been an amazing experience to say the least. We look forward to seeing and catching up with the Class of 2010 at the reunion in a few months.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299241193390558293/image.jpg","PHOTO_1_CAPTION":"Scott Swisher's son, Landon, at 10 months","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Alison","LAST_NAME":"Woodhead","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Alison Woodhead (MBA) has been promoted to partner at Morgan Samuels, a leading retained executive search firm. Her primary areas of focus include private equity, technology, and media.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Dayton","LAST_NAME":"Young","PROGRAM":"MBA","CLASS_YEAR":2010,"CLASS_NOTE":"Dayton Young (MBA) 2010 is working as the senior product manager for WATCH Disney Channel online and on Apple TV. He also produced his first play as part of the 2013 Hollywood Fringe Festival and recently self-published a Halloween-themed children's book titled The House on Haunted Hollow.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299318263332779641/Screen%20Shot%202015-02-09%20at%2011.08.41%20AM.png","PHOTO_1_CAPTION":"The House on Haunted Hollow, by Dayton Young","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/18/15","FIRST_NAME":"David","LAST_NAME":"Church","PROGRAM":"FEMBA","CLASS_YEAR":2010,"CLASS_NOTE":"In David Church's (FEMBA) role at Bank of America, he was proud to receive the \"Global Diversity & Inclusion\" award in Q4 2014. The nomination-based award had more than 4,000 nominations, with only 102 selected. Winners were flown out to Bank of America's headquarters in Charlotte, North Carolina and presented the award by the company's chief executive officer and members of the leadership team.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297450193391200007/BAC_Global%20Diversity%20and%20Inclusion%20award_12.04.14.jpg","PHOTO_1_CAPTION":"David Church's Global Diversity & Inclusion Award","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Andrew","LAST_NAME":"Jing","PROGRAM":"FEMBA","CLASS_YEAR":2010,"CLASS_NOTE":"Andrew Jing (FEMBA) decided that four years of consulting was enough and left McKinsey for Google. He writes, \"I'll be in product marketing for YouTube, helping them grow their next generation of music products! Check out YouTube.com/MusicKey for a glimpse of what I'm working on!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/25/15","FIRST_NAME":"Eric","LAST_NAME":"Lai","PROGRAM":"FEMBA","CLASS_YEAR":2010,"CLASS_NOTE":"Eric Lai (FEMBA) founded Archvest Wealth Advisors in August 2014. AWA is a comprehensive financial planning firm with specialized services focused on the four pillars of planning: investments, estate, taxes, and insurance.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/5/15","FIRST_NAME":"Subbu","LAST_NAME":"Muthu","PROGRAM":"FEMBA","CLASS_YEAR":2010,"CLASS_NOTE":"Subbu Muthu (FEMBA) writes, \"I have been having a really good time with my company. I have the full responsibilities to manage the product and run the software and customer care operations. My CEO is busy with another startup. I have visited lot of places in the last five years for both personal and business: Brazil, Costa Rica, Peru, Cancun, Chicen Itza, Mexico City, Japan, England, Germany to name some of them. I have 2 wonderful kids. My son really sings well and is good player in chess. My daughter is so sharp and assertive. Might be she got her genes from her mom.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Michele","LAST_NAME":"Low","PROGRAM":"EMBA","CLASS_YEAR":2010,"CLASS_NOTE":"Michele Low (EMBA) 2010 and Ben Helvey '10 were married in October 2011 and currently reside in Santa Monica, CA. Their first son, Nathan, was born in April 2014. Michele is a director of real estate for a national grocery chain. Ben is a vice president at Morgan Stanley.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Kim","LAST_NAME":"Merritt","PROGRAM":"EMBA","CLASS_YEAR":2010,"CLASS_NOTE":"Kim Merritt (EMBA) updates, \"I started the Cooper Merritt Group at Merrill Lynch in Santa Monica with senior wealth management advisor Michael Cooper. This is a wonderful fit, giving me the ability to focus on everything financial for the family, from retirement planning to intergenerational wealth transfer. Last year I became a CFP, furthering my securities licensing with greater capacity for the integrative planning that ties investments to life goals. In the UCLA community, I am building programming as president of Anderson Women, our women's alumni network. As often as possible, I enjoy the breadth of the UCLA community through cross-campus programming as a board member of UCLA Women and Philanthropy, and I recently joined UCLA Friends of English, a group that hosts exceptional literary discussions. I have returned to tennis, hikes, bicycling, and ranch vacations, deeply appreciating time to be outdoors more. My old dog, Amigo, and I made the big move to disrupt our domestic bliss with a new golden pup. We three are quite content; my garden, less so! Daughter Sara announced her engagement and eventual move back to Los Angeles, Ali and Jeff are considering a State Department assignment abroad, and Bo will graduate Barnard in May! All that is what five years can bring!\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299244453645961183/kim-173_R.jpg","PHOTO_1_CAPTION":"Kim Merritt and family","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Taitama","LAST_NAME":"Tolman","PROGRAM":"EMBA","CLASS_YEAR":2010,"CLASS_NOTE":"Taitama Tolman (EMBA) greets, \"Aloha from Malaysia dear classmates, faculty, and alumni! It's been a whirlwind of adventures since we last met five years ago. I miss and cherish the terrific experiences and education we shared together. My family and I are still living, loving, and working in Malaysia (closing in on 10 years). Both my career and family size have also since blossomed─I currently (attempt to) manage four wonderful children while overseeing my company's steadily expanding South East Asia manufacturing and retail operations for Melaleuca, the Wellness Company. In our fleeting spare time, my family and I enjoy working with several local orphanages and child refugee programs, in addition to church service, and teaching the underprivileged to play the ukulele (not so much on the later :)). I think of our time together often and it has inspired and influenced my path in enumerable ways since. I hope and wish the best for each of you and please do keep in touch and give me a ring whenever you're my region.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299265195912200392/Fam3%20%28edit%29.jpg","PHOTO_1_CAPTION":"Taitamar Tolman's tribe","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Ron","LAST_NAME":"Friedman","PROGRAM":"MBA","CLASS_YEAR":2011,"CLASS_NOTE":"Ron Friedman (MBA) joyously announces, \"A beautiful baby boy, Michel A. Friedman, was born at 12:27 am on December 23rd, 2014.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299218902214161410/image.jpg","PHOTO_1_CAPTION":"Ron Friedman's new boy Michael","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Ryan","LAST_NAME":"Posly","PROGRAM":"FEMBA","CLASS_YEAR":2011,"CLASS_NOTE":"Ryan Posly (FEMBA) has recently relocated to Chicago, where he's joined boutique strategy consulting firm Stax Inc. He is enjoying the winter.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/25/15","FIRST_NAME":"Ann","LAST_NAME":"Wei","PROGRAM":"FEMBA","CLASS_YEAR":2011,"CLASS_NOTE":"Ann Wei (FEMBA) and Steve Nguyen (FEMBA 2012) were married this past weekend. Ann writes, \"We wouldn't have met had it not been without the program, so we have one more thing to be thankful to Anderson for!\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/298121182021768637/image.jpg","PHOTO_1_CAPTION":"Ann Wei and Steve Nguyen's first dance","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Craig","LAST_NAME":"Muhlrad","PROGRAM":"MBA","CLASS_YEAR":2012,"CLASS_NOTE":"Craig Muhlrad (MBA) is getting married to Melody Hwang (UCLA '15) in March 2015.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/17/15","FIRST_NAME":"J.P.","LAST_NAME":"Voisinet","PROGRAM":"MBA","CLASS_YEAR":2012,"CLASS_NOTE":"J.P. Voisinet (MBA) and his wife Meghan are expecting their first child in May, a baby girl to be named Kate!","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Ian","LAST_NAME":"Pyrah","PROGRAM":"GEMBA","CLASS_YEAR":2012,"CLASS_NOTE":"Ian Pyrah (GEMBA Asia Pacific) relates, \"We had a great end to 2014 with what is now an annual trip to Big Bear ski resort. The snow was excellent and we had great fun with Sophie and Alex on the slopes. We also took the plunge and invested in an Airstream RV trailer so we're now looking forward to weekends away in 2015.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/26/15","FIRST_NAME":"Craig","LAST_NAME":"Wilson","PROGRAM":"EXEC ED/CERT","CLASS_YEAR":2012,"CLASS_NOTE":"Craig Wilson (EXEC ED/CERT) is supporting Los Angeles start-up community as principal adviser for Bixel Exchange Accelerator. Craig informs, \"In 2014 we helped 67 startups move from idea to formation. Our goal is to double the number of startups in 2015. In February, I'll be a panelist for UCLA 3 Day Startup helping UCLA students navigate their creativity for entrepreneurship.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/2/15","FIRST_NAME":"Dennis","LAST_NAME":"Liusso","PROGRAM":"BS","CLASS_YEAR":2012,"CLASS_NOTE":"Dennis Liusso (BS) offers, \"We have various services. Visit our site to know more details: http://www.mrgutterusa.com.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/298743683522620879/mr.gutter73.jpg","PHOTO_1_CAPTION":"Dennis Liusso's company, Gutter Home Services","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Ethan","LAST_NAME":"Titelman","PROGRAM":"FEMBA","CLASS_YEAR":2013,"CLASS_NOTE":"Ethan Titelman (FEMBA) and his wife, Kirsten, welcome the birth of their first child, Miles, on December 1, 2014. Miles weighed 5 lb and 15 oz.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297272087632697206/image.jpg","PHOTO_1_CAPTION":"Ethan and Kirsten Titelman and new baby boy Miles.","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Bret","LAST_NAME":"Morriss","PROGRAM":"EMBA","CLASS_YEAR":2013,"CLASS_NOTE":"Bret Morriss (EMBA) and Dan Brown (EMBA '16) are co-founders of aviationheroes.org, a non-profit organization formed to help transitioning military pilots and mechanics navigate FAA regulations and network to find their next exciting career in the aviation industry.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/297263288351464586/image.jpg","PHOTO_1_CAPTION":"Bret Morris and Dan Brown encourage, \"Hire Our Aviation Heroes\"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/1/15","FIRST_NAME":"Patrick J.","LAST_NAME":"Stern","PROGRAM":"EMBA","CLASS_YEAR":2013,"CLASS_NOTE":"Patrick J. Stern (EMBA) admits, \"I was not planning on a career shift when I began the EMBA program. Within a few months of graduating I moved from R&D to a position in corporate planning and strategy with Astellas Pharmaceuticals, Inc. at our US Headquarters. Within a year of that transition, I've accepted a two-year ex-patriate assignment in our Astellas global headquarters in Tokyo, Japan. My last visit to Tokyo was an elective as part of obtaining my Advanced International Management certificate almost two years ago. I am ever inspired and grateful to my peers, teachers, and the Anderson experience for the opportunities I've been given.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Jill","LAST_NAME":"Prantera","PROGRAM":"EMBA","CLASS_YEAR":2013,"CLASS_NOTE":"Jill Prantera (EMBA) left II-VI Optical Systems in August 2014 to accept a position with Flextronics International as director, global account management. Jill is putting the UCLA Executive MBA skills to good use!","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Romit","LAST_NAME":"Gulati","PROGRAM":"FEMBA","CLASS_YEAR":2014,"CLASS_NOTE":"Romit Gulati (FEMBA) shares, \"Five months after graduating from the FEMBA program in 2014, my wife Jharna and I were blessed with a baby girl. Her name is Celia, inspired from Shakespeare's \"As you like it.\" I recently decided to put my career on hold to spend some quality time with my family. I'm amazed at how fast my baby is growing and am loving every minute of this sabbatical. I plan to pursue my next adventure in spring 2015 in tech marketing and business development. Hopefully I'll get to work with a fellow Anderson Alum!\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"1/16/15","FIRST_NAME":"Ryan","LAST_NAME":"Hughes","PROGRAM":"FEMBA","CLASS_YEAR":2014,"CLASS_NOTE":"Ryan Hughes (FEMBA) has successfully survived the critical one-year mark for his San Diego-based investment management firm, Bull Oak Capital. The firm was launched after the completion of a successful Anderson research project under the direction of Professor Hanno Lustig. You can learn about the firm and its history by visiting www.bulloakcapital.com.","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"Abhinav","LAST_NAME":"Sarna","PROGRAM":"FEMBA","CLASS_YEAR":2014,"CLASS_NOTE":"Abhinav Sarna (FEMBA) shares, \"Investment classes at Anderson exposed me to empirical research in the areas of financial markets and money management. Following the research done by Fama, French and other finance gurus, in 2015, I was propelled into the investment industry and joined Dimensional Fund Advisors (DFA) in their research systems group. DFA is a unique investment firm that uses academic strategies and empirical research for investment management.","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299219065261552411/image.jpg","PHOTO_1_CAPTION":"Abhinav Sarna","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/10/15","FIRST_NAME":"Patrice","LAST_NAME":"Crisinel","PROGRAM":"EXEC ED/CERT","CLASS_YEAR":2014,"CLASS_NOTE":"Patrice Crisinel (EXEC ED/CERT) shares a special trip to UCLA Lake Arrowhead Conference Center in March 2014 during the EP with the family. True happiness!","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/8/15","FIRST_NAME":"John","LAST_NAME":"Popoch","PROGRAM":"EXEC ED/CERT","CLASS_YEAR":2014,"CLASS_NOTE":"John Popoch (EXEC ED/CERT) gratefully updates, \"I am legislative director for Los Angeles City Councilmember Bob Blumenfield. The curriculum at Anderson helps me work on economic development issues with our business community. Not only is this important to my goals to meet the needs of all constituents but should be a focus of all staffers for elected officials. It gives me a better understanding and more tools to help our local businesses drive our economic engine forward. Thanks Anderson.\"","PHOTO_1":"","PHOTO_1_CAPTION":"","PHOTO_2":null,"PHOTO_2_CAPTION":null},
{"SUBMISSION_DATE":"2/9/15","FIRST_NAME":"Dora","LAST_NAME":"Wang","PROGRAM":"EXEC ED/CERT","CLASS_YEAR":2014,"CLASS_NOTE":"Dora Wang (EXEC ED/CERT) announces, \"I've become a founding member of Invest New Mexico, an EB-5 regional center. Having published my second book, The Daily Practice of Compassion, in 2014, I'll now put these energies into a digital health startup, DearDrDora.com.\"","PHOTO_1":"http://www.jotform.com/uploads/alumoff/22746332668157/299269966935361660/Wang011.jpg","PHOTO_1_CAPTION":"Dora Wang","PHOTO_2":null,"PHOTO_2_CAPTION":null}]
